# Ungraded Lab: CRUD Operations Lab

## üìã Overview 
In this lab, you'll practice essential SQL data manipulation commands: INSERT, UPDATE, and DELETE. Using the BookCycle transactions dataset, you'll simulate real-world scenarios of managing book transaction records. This hands-on experience will reinforce your understanding of CRUD operations and their importance in maintaining data integrity.

## üéØ Learning Outcomes
By the end of this lab, you will be able to:
- Execute INSERT operations to add new transaction records
- Perform UPDATE operations to modify existing transaction data
- Use DELETE operations to remove specific records from the dataset
- Understand the importance of transaction control in maintaining data consistency

## üìö Dataset Information
We'll be working with the <b>transactions.csv</b> dataset, which contains individual book transaction records for BookCycle stores. Each row represents a single transaction with details such as <b>transaction ID, date and time, store location, customer ID, book ID, sale price, payment method, and whether the transaction was online or in-store</b>.

## üñ•Ô∏è Activities

### Activity 1: Setting Up the Environment  

Before we start manipulating data, we need to set up our working environment and load the dataset.

<b>Step 1: </b> Import the necessary libraries

In [1]:
import sqlite3
import pandas as pd

<b>Step 2:</b> Load the dataset and create a temporary SQLite Database:

In [2]:
# Load the CSV file
df = pd.read_csv('transactions.csv')

# Create a temporary SQLite database and load the data
conn = sqlite3.connect(':memory:')
df.to_sql('transactions', conn, index=False)

# Create a cursor object
cursor = conn.cursor()

<b>Step 3: </b> Verify the data has been loaded correctly:

In [3]:
# Check the first few rows of the transactions table
query = "SELECT * FROM transactions LIMIT 5;"
result = pd.read_sql_query(query, conn)
display(result)

,transaction_id,date_time,store_location,customer_id,book_id,sale_price,payment_method,is_online
0,T1001,2023-01-15 09:23:45,University,C1045,B1055,11.99,credit,0
1,T1002,2023-01-15 10:15:22,Downtown,C1023,B1032,10.99,debit,0
2,T1003,2023-01-15 10:45:33,Suburban,C1078,B1036,11.99,cash,0
3,T1004,2023-01-15 11:30:15,University,C1012,B1071,13.99,credit,1
4,T1005,2023-01-15 13:45:22,University,C1034,B1075,12.99,debit,0

 <b>üí° Tip:</b> Always verify your data after loading it into a database to ensure it's in the expected format.

### Activity 2: INSERT Operation

BookCycle has just completed a new transaction and needs to add it to the database.

<b>Step 1:</b> Write an INSERT statement to add a new transaction:

In [4]:
insert_query = """
INSERT INTO transactions 
(transaction_id, date_time, store_location, customer_id, book_id, sale_price, payment_method, is_online)
VALUES (?, ?, ?, ?, ?, ?, ?, ?);
"""

# Example data for a new transaction
new_transaction = ('T1101', '2023-02-01 10:00:00', 'University', 'C1090', 'B1100', 14.99, 'credit', 0)

cursor.execute(insert_query, new_transaction)
conn.commit()

<b>Step 2:</b> Verify the insertion:

In [5]:
verify_query = "SELECT * FROM transactions WHERE transaction_id = 'T1101';"

result = pd.read_sql_query(verify_query, conn)
display(result)

,transaction_id,date_time,store_location,customer_id,book_id,sale_price,payment_method,is_online
0,T1101,2023-02-01 10:00:00,University,C1090,B1100,14.99,credit,0

 <b>üí° Tip:</b> Always commit your changes after an INSERT operation to save them to the database.

### Activity 3: UPDATE Operation

A customer has requested to change their payment method for a recent transaction.

<b>Step 1:</b> Write an UPDATE statement to modify the payment method:

In [6]:
update_query = """
UPDATE transactions
SET payment_method = ?
WHERE transaction_id = ?;
"""

# Update the payment method for transaction T1101
cursor.execute(update_query, ('debit', 'T1101'))
conn.commit()

<b>Step 2:</b> Verify the update:

In [7]:
verify_query = "SELECT * FROM transactions WHERE transaction_id = 'T1101';"

result = pd.read_sql_query(verify_query, conn)
display(result)

,transaction_id,date_time,store_location,customer_id,book_id,sale_price,payment_method,is_online
0,T1101,2023-02-01 10:00:00,University,C1090,B1100,14.99,debit,0

 <b>üí° Tip:</b> Use WHERE clauses carefully in UPDATE statements to avoid unintended modifications to multiple records.

### Activity 4: DELETE Operation

BookCycle needs to remove a cancelled transaction from the database.

<b>Step 1:</b> Write a DELETE statement to remove a specific transaction:

In [8]:
delete_query = "DELETE FROM transactions WHERE transaction_id = ?;"

# Delete transaction T1101
cursor.execute(delete_query, ('T1101',))
conn.commit()

<b>Step 2:</b> Verify the deletion:

In [9]:
verify_query = "SELECT * FROM transactions WHERE transaction_id = 'T1101';"

# Resulting output should show only the header row and no data, confirming deletion.
result = pd.read_sql_query(verify_query, conn)
display(result)

Empty DataFrame
Columns: [transaction_id, date_time, store_location, customer_id, book_id, sale_price, payment_method, is_online]
Index: []

 <b>üí° Tip:</b> Always double-check your WHERE clause in DELETE statements to avoid accidentally deleting the wrong data.

#### Close the Connection
It's good practice to close the database connection when you're done

In [10]:
# Close the database connection 
conn.close()

## ‚úÖ Success Checklist
- You can successfully insert a new transaction record
- You can update existing transaction details
- You can delete a specific transaction record
- All operations are verified after execution

## üîç Common Issues & Solutions 

- Problem: Changes not reflected in the database 
  - Solution: Ensure you call conn.commit() after each operation
  
- Problem: SQL Syntax errors
  - Solution: Double-check your query syntax, especially quotation marks and parentheses
  
## ‚û°Ô∏è Summary

Well done on completing this lab on SQL data manipulation! You've now mastered the essential CRUD operations, equipping you with the skills to effectively manage and maintain data integrity in real-world databases. These fundamental abilities will prove invaluable as you continue to grow in your role as a data professional at BookCycle and beyond.

### üîë Key Points
- INSERT adds new records to a table
- UPDATE modifies existing records
- DELETE removes specific records from a table
- Always verify your operations to ensure data integrity